{
  "chinese": {
    "api": {
      "type": "对应列的类型。多选框设置 selection；可展开的按钮设置 expand",
      "label": "标题",
      "prop": "对应列内容的字段名",
      "width": "对应列的宽度",
      "min-width": "对应列的最小宽度，与 width 的区别是 width 是固定的，min-width 会把剩余宽度按比例分配给设置了 min-width 的列",
      "fixed": "列是否固定在左侧或者右侧，true 表示固定在左侧",
      "sortable": "对应列是否可以排序，如果设置为 'custom'，则代表用户希望远程排序，需要监听 Table 的 change 事件事件,需要配置 'prop' 属性",
      "sort-method": "对数据进行排序的时候使用的方法，仅当 sortable 设置为 true 的时候有效，需返回一个数字，和 Array.sort 表现一致",
      "sort-orders": "数据在排序时所使用排序策略的轮转顺序，仅当 sortable 为 true 时有效。需传入一个数组，随着用户点击表头，该列依次按照数组中元素的顺序进行排序",
      "align": "对齐方式",
      "header-align": "表头对齐方式，优先级高于表格的对齐方式",
      "class-name": "列的 className",
      "label-class": "当前列标题的自定义类名",
      "show-overflow-tooltip": "当内容过长时展示省略号，hover 时是否显示 tooltip 展示全部内容，设置在table-column 上优先于 table",
      "formatter": "用来格式化内容",
      "filters": "表头的筛选菜单项",
      "filtered-value": "筛选的受控属性，支持.sync，外界可用此控制列的筛选状态，值为已筛选的 value 数组",
      "filter-dropdown-visible": "用于控制自定义筛选菜单是否可见，支持 .sync",
      "filter-method": "数据过滤使用的方法，支持.sync，返回 true 就会显示",
      "filter-multiple": "是否多选",
      "show-filter-actions": "是否显示过滤下拉中的操作按钮，仅在单选时生效",
      "column-key": "column 的 key，如果没有配置的话，会尝试使用 prop 属性。如果需要使用 change 事件，则需要此属性标识是哪个 column 的筛选条件",
      "resizable": "对应列是否可以通过拖动改变宽度，目前需要设置 mtd-table 的 bordered 属性为 true，后续版本会删除此限制",
      "overflow-selector": "用于获取内容超长的元素，用获取到的元素来判断是否展示超长 tooltip，超出内容宽度即展示文字提示",
      "header": "自定义表头的内容, 0.3.8 版本支持 fixed 属性",
      "column": "自定义列的内容, 0.3.8 版本支持 fixed 属性",
      "selection": "自定义复选框内容，仅在type='selection'下生效，参数中 props 包含 checkbox 所需状态属性，on 中包含 input 事件监听",
      "filter-icon": "自定义过滤显示的 icon，参数 actived 表示当前下拉面板是否激活, filtered 表示当前是否过滤中",
      "filter-dropdown": "自定义过滤的下拉面板",
      "expand": "非 tree 情况下自定义展开按钮"
    }
  },
  "english": {
    "api": {
      "type": "Type of the corresponding column. Multiple selection selection; Expandable buttons set Expand.",
      "label": "Title",
      "prop": "The field name corresponding to the column contents.",
      "width": "The width of the corresponding column.",
      "min-width": "The minimum width of the corresponding column. The difference from width is that width is fixed, and min-width proportionally allocates the remaining width to the column that is set to min-width.",
      "fixed": "Whether the column is fixed to the left or right, true means fixed to the left.",
      "sortable": "Whether the corresponding column can be sorted. If the value is set to 'custom', it indicates that the user wants to sort the Table remotely and needs to listen for the change event event of the Table. The property 'prop' needs to be configured.",
      "sort-method": "This method is valid only when sorTable is set to true. A number must be returned, which is the same as Array.sort.",
      "sort-orders": "Rotation order in which data is sorted using the sort policy, valid only if sortable is true. You need to pass in an array, and as the user clicks on the table header, the columns are sorted in order of the elements in the array.",
      "align": "Alignment.",
      "header-align": "Table header alignment, which has a higher priority than table alignment.",
      "class-name": "ClassName of column.",
      "label-class": "The custom class name of the current column header.",
      "show-overflow-tooltip": "If the content is too long, ellipses are displayed. If the content is hover, whether to display tooltip displays all the content, and set it to display all the content on table-column rather than table.",
      "formatter": "To format the content.",
      "filters": "Filter menu items for the table header.",
      "filtered-value": "Controlled properties of the filter. Support .sync, which controls the filter status of the column, and the value is an array of filtered values.",
      "filter-dropdown-visible": "Used to control whether custom filter menus are visible. Support .sync.",
      "filter-method": "Data filtering method, support .sync, return true will be displayed.",
      "filter-multiple": "Whether alternative.",
      "show-filter-actions": "Specifies whether to display the operation button in the filter drop-down list. This parameter takes effect only when the option is selected.",
      "column-key": "The key for column, if not configured, will try to use the prop property. If you want to use the change event, you need this attribute to identify the filter for which column it is.",
      "resizable": "Whether the width of the corresponding column can be changed by dragging it, you must set the bordered property of the wt-table to true. This restriction will be deleted in later versions.",
      "overflow-selector": "Used to get an element with very long content, which is used to determine whether to display a very long tooltip, or to display a text prompt beyond the content width.",
      "header": "Customize the content of the table header. Version 0.3.8 supports fixed attribute.",
      "column": "Customize column content, version 0.3.8 supports fixed attribute.",
      "selection": "This parameter is valid only when type='selection'. The props parameter contains the required state properties for the checkbox. The on parameter contains the input event listener.",
      "filter-icon": "Set the icon to be filtered. Actived indicates whether the drop-down panel is activated. Filtered indicates whether the drop-down panel is being filtered.",
      "filter-dropdown": "A drop-down panel for custom filtering.",
      "expand": "Customize the expansion button in the non-tree case."
    }
  }
}
